Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མང་ངོ་།
en: asked the Blessed One. “There will be many!

source: །བདེ་བར་གཤེགས་པ་དེ་ནི་མང་སྟེ།
en: Sugata, there will be many!

source: སྐྱེས་བུ་དེའི་རྣམ་པར་རྟོག་པ་དེ་ནི་ཉིན་མཚན་འདས་པས་ཤིན་ཏུ་མང་བར་འབྱུང་ངོ་།
en: The thoughts of that man over a day or night will be extremely many.” {

source: རབ་འབྱོར་སྐྱེས་བུ་དེའི་རྣམ་པར་རྟོག་པ་ནི་ཉིན་མཚན་འདས་པས་ཇི་སྙེད་ཅིག་འབྱུང་བ་དེ་སྙེད་ཀྱི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཁོར་བ་སྤོང་ཞིང་རྒྱབ་ཀྱིས་ལྟས་བར་འགྱུར་རོ། །གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་ཇི་སྐད་དུ་བསྟན་པ་འདི་ལ་སློབ་པ་དང་། ཉེ་བར་རྟོག་པ་དང་། སེམས་པ་དང་།
en: IV: 167} “Subhūti,” continued the Blessed One, “as many as the thoughts that man has over a day or night, for so many eons will bodhisattva great beings spurn cyclic existence and turn their backs on it.

source: ཉེས་པ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པའི་ཉེས་པ་དེ་དག་ཅི་ནས་ཀྱང་སྤངས་པར་འགྱུར་བ་དེ་ལྟར་བརྩོན་པར་བྱེད་ན། རབ་འབྱོར་དེ་ལྟར་བརྩོན་པས་རྗེས་སུ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་གནས་པ་དེས་ཉིན་གཅིག་ལ་དགེ་བའི་རྩ་བ་གང་ཡོངས་སུ་བཟུང་བ་དེས། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་ཡོངས་སུ་གང་བར་གྱུར་ཀྱང་དེས་ནི་དགེ་བའི་རྩ་བ་དེའི་ལྷག་མ་ལ་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་བརྒྱ་སྟོང་གི་ཆ་དང་། གྲངས་དང་ཆ་དང་བགྲང་བ་དང་། དཔེ་དང་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: If bodhisattva great beings train, investigate, and reflect in accordance with the teachings as they are revealed in this profound perfection of wisdom, and if they spurn by all means those faults by which they would turn away from unsurpassed, complete enlightenment, and persevere in that manner, then, Subhūti, those bodhisattva great beings who strive in this endeavor, abiding in accordance with the teachings as they are revealed in this profound perfection of wisdom, will in a single day acquire roots of virtuous action such that those accrued by having filled world systems numerous as the grains of sand of the river Gaṅgā [with gifts] could not come anywhere near even a hundredth part of their residue of the roots of virtuous action, and could not come anywhere near even a thousandth part, a hundred thousandth part, or any fraction, number, comparison, or material part. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་དཀོན་མཆོག་དང་ཆོས་དཀོན་མཆོག་དང་དགེ་འདུན་དཀོན་མཆོག་དང་། དཀོན་མཆོག་གསུམ་ལ་སྦྱིན་པ་བྱིན་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they offer gifts to the Three Precious Jewels—namely to the precious jewel of the Buddha, the precious jewel of the Dharma, and the precious jewel of the Saṅgha—over eons as numerous as the grains of sand of the river Gaṅgā, do you think, Subhūti, that the merits of those bodhisattva great beings would on that basis increase manifold?” “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་མང་ངོ་།
en: Blessed Lord, they would be manifold!

source: །བདེ་བར་གཤེགས་པ་མང་སྟེ།
en: Sugata, they would be manifold!

source: ཚད་མ་མཆིས་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་བསམ་གྱིས་མི་ཁྱབ་མཚུངས་པ་མ་མཆིས་སོ།
en: They would be immeasurable, inestimable, inconceivable, and incomparable!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་ཇི་སྐད་དུ་བསྟན་པ་འདི་ལ་བརྩོན་པར་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Subhūti,” continued the Blessed One, “if there are bodhisattva great beings who persevere in accordance with the teachings as they are revealed in this profound perfection of wisdom, their merits will increase manifold even more than the former.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚུལ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚུལ་ལོ། །།།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། བམ་པོ་ལྔ་བཅུ་གཉིས་པ།
en: If you ask why, the way of bodhisattva great beings is the way by which consummate buddhahood is attained in unsurpassed, complete enlightenment. “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བ། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པར་འདུག་ཅིང་རྒྱུན་དུ་ཞུགས་པ་ལ་ཡོན་ཕུལ་ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་དགྲ་བཅོམ་པ་དང་རང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཡོན་ཕུལ་ན་རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Subhūti, when bodhisattva great beings who lack the perfection of wisdom offer donations, over eons equal in number to the grains of sand of the river Gaṅgā, to those who have entered the stream to nirvāṇa, and when they offer donations to those who are destined for only one more rebirth, to those who are no longer subject to rebirth, to arhats and pratyekabuddhas, and to the tathāgatas, arhats, completely awakened buddhas, do you think, Subhūti, that the merits of those bodhisattva great beings would increase manifold on that basis?” {

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་ཇི་སྐད་བསྟན་པ་འདི་ལ་བརྩོན་པར་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: The Blessed One continued, “When any noble son or noble daughter perseveres in accordance with the teachings as they are revealed in this profound perfection of wisdom, their merits will increase manifold even more than the former.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: If you ask why, it is because the bodhisattva great beings who practice this perfection of wisdom transcend the levels of the śrāvakas and the pratyekabuddhas, and after entering upon the maturity of the bodhisattvas, they will attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བ་ཞིག་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་འདུག་ཅིང་འཚོ་སྟེ། སྦྱིན་པ་བྱིན་ཚུལ་ཁྲིམས་བསྲུངས་བཟོད་པ་བསྒྲུབས། བརྩོན་འགྲུས་བརྩམས། བསམ་གཏན་ལ་མཉམ་པར་བཞག །ཤེས་རབ་བསྒོམས་ན་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Subhūti, when certain bodhisattva great beings, lacking the perfection of wisdom, and living for eons equal in number to the grains of sand of the river Gaṅgā, offer generosity, maintain ethical discipline, practice tolerance, undertake perseverance, become absorbed in meditative concentration, and cultivate wisdom, do you think that their merits would increase manifold on that basis?” “

source: བཅོམ་ལྡན་འདས་མང་ངོ་བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Sugata, they would be manifold!” “

source: རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ཏེ། ཉི་མ་འགའ་ཞིག་སྦྱིན་པ་བྱིན་པ་དང་། ཚུལ་ཁྲིམས་བསྲུངས་པ་དང་། བཟོད་པ་བསྒྲུབས་པ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་དང་། བསམ་གཏན་ལ་མཉམ་པར་བཞག་པ་དང་། ཤེས་རབ་བསྒོམས་པ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Subhūti,” continued the Blessed One, “when any noble son or noble daughter, abiding in this perfection of wisdom, for just a few days offers generosity, maintains ethical discipline, practices tolerance, cultivates perseverance, becomes absorbed in meditative concentration, and cultivates wisdom, their merits will increase manifold even more than the former.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མའོ།
en: If you ask why, Subhūti, it is because this perfection of wisdom is the mother of bodhisattva great beings.

source: །འདི་ལྟ་སྟེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སྐྱེད་པའོ།
en: That is to say, this perfection of wisdom generates bodhisattva great beings.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Abiding in this perfection of wisdom, bodhisattva great beings bring all phenomena to completion. “

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་ཏེ། ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ། གསོལ་པ།
en: Subhūti, when bodhisattva great beings, lacking the perfection of wisdom, and remaining for eons equal in number to the grains of sand of the river Gaṅgā, offer the gift of the Dharma, do you think that the merits of those noble sons or noble daughters would increase manifold on that basis?” “

source: བཅོམ་ལྡན་འདས་མང་ངོ་བདེ་བར་གཤེགས་པ་མང་ངོ་།
en: Blessed Lord, they would be manifold! Sugata, they would be manifold!” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་གནས་ཏེ། ཉི་མ་འགའ་ཞིག་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་ན་དེའི་བསོད་ནམས་དང་དེའི་རྒྱུས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Subhūti,” continued the Blessed One, “when any noble son or noble daughter, abiding in accordance with the teachings as they are revealed in this perfection of wisdom, for just a few days offers the gift of the Dharma, their merits will increase manifold even more on that basis than the former.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་བྲལ་བའོ།
en: If you ask why, Subhūti, it is because bodhisattva great beings who lack the perfection of wisdom also lack all-aspect omniscience. {

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བ་སྟེ།
en: Ki.IV: 169} Subhūti, bodhisattva great beings who do not lack the perfection of wisdom do not lack all-aspect omniscience. “

source: རབ་འབྱོར་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བར་བྱའོ། །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: So it is, Subhūti, that bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should not lack the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་ཏེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་ཡང་དག་པར་སྤོང་བ་བཞི་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་དབང་པོ་ལྔ་དང་སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་བསམ་གཏན་བཞི་དང་ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་བརྩོན་པར་བྱས་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: Subhūti, when bodhisattva great beings, who lack the perfection of wisdom, abiding for eons equal in number to the grains of sand of the river Gaṅgā, persevere with the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, and the meditative stabilities of emptiness, signlessness, and wishlessness, do you think, Subhūti, that the merits of those noble sons or noble daughters would increase manifoldly on that basis?” “

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Blessed Lord, they would be manifold!

source: གསོལ་པ་བཅོམ་ལྡན་འདས་མང་ངོ་བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Sugata, they would be manifold!” “

source: རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལས་ཇི་སྐད་དུ་བསྟན་པ་བཞིན་དུ་གནས་ཏེ། ཉི་མ་འགའ་ཞིག་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་བསམ་གཏན་བཞི་དང་ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་བརྩོན་པར་བྱས་ན་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Subhūti,” continued the Blessed One, “when any noble son or noble daughter, abiding in accordance with the teachings as they are revealed in this profound perfection of wisdom, for just a few days perseveres with the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, and the meditative stabilities of emptiness, signlessness, and wishlessness, their merits will increase manifold even more on that basis than the former.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཕྱིར་ལྡོག་པ་དེ་ནི་གནས་མེད་སྐབས་མེད་དེ་དེ་ནི་གནས་མ་ཡིན་ནོ།
en: If you ask why, there is no circumstance and no occasion in which bodhisattva great beings who do not lack the perfection of wisdom will turn away from all-aspect omniscience.

source: །རབ་འབྱོར་འདི་ནི་གནས་ཡིན་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཕྱིར་ལྡོག་པའི་གནས་ཡོད་དོ།
en: That would be impossible! On the other hand, Subhūti, it is possible that bodhisattva great beings who lack the perfection of wisdom might turn away from all-aspect omniscience.

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བར་བྱའོ།
en: So it is, Subhūti, that bodhisattva great beings should not lack the perfection of wisdom. {Ki.

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བས། བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་ཏེ་ཟང་ཟིང་གི་སྦྱིན་པ་དེ་དང་ཆོས་ཀྱི་སྦྱིན་པ་དེ་དང་། ནང་དུ་ཡང་དག་པར་འཇོག་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ་གསོལ་པ།
en: IV: 170} “Subhūti, when bodhisattva great beings who lack the perfection of wisdom, abiding over eons equal in number to the grains of sand of the river Gaṅgā, dedicate material gifts, the gift of the Dharma, and the modes of attention associated with meditative seclusion to unsurpassed, complete enlightenment, do you think that the respective merits of those noble sons or noble daughters would increase manifold on that basis?” “

source: རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལས་ཇི་སྐད་དུ་བསྟན་པ་བཞིན་དུ་གནས་ཏེ། ཉི་མ་འགའ་ཞིག་ཟང་ཟིང་གི་སྦྱིན་པ་དེ་དང་། ཆོས་ཀྱི་སྦྱིན་པ་དེ་དང་། ནང་དུ་ཡང་དག་པར་འཇོག་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Subhūti,” continued the Blessed One, “when any noble son or noble daughter, abiding in accordance with the teachings as they are revealed in this profound perfection of wisdom, for just a few days dedicates those material gifts, that gift of the Dharma, and those modes of attention associated with meditative seclusion to unsurpassed, complete enlightenment, then the merits of those noble sons or noble daughters would increase manifold more than the former.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཡོངས་སུ་བསྔོ་བ་འདི་ནི་བསྔོ་བའི་མཆོག་གོ།
en: If you ask why, it is because this dedication of the perfection of wisdom is supreme among dedications.

source: །གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་ཡོངས་སུ་བསྔོ་བ་མ་ཡིན་ནོ།
en: The dedication that lacks the perfection of wisdom is no dedication.

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པར་བྱའོ།
en: So it is, Subhūti, that bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should be skilled in the dedication of the perfection of wisdom. “

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བ་གང་ལ་ལས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་ཏེ། འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དེ་ཐམས་ཅད་ལ་རྗེས་སུ་ཡི་རང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Subhūti, when certain noble sons or noble daughters who lack the perfection of wisdom, abiding over eons equal in number to the grains of sand of the river Gaṅgā, rejoice in all the roots of virtuous action of the lord buddhas of the past, future, and present, along with their monastic communities of śrāvakas, and dedicate these [roots] toward unsurpassed, complete enlightenment, do you think that the merits of those noble sons or noble daughters would increase manifold on this basis?” “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་མང་ངོ་བདེ་བར་གཤེགས་པ་མང་ངོ་།
en: Blessed Lord, they would be manifold! Sugata, they would be manifold!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་ཇི་སྐད་དུ་བསྟན་པ་འདི་ལ་གནས་ཏེ། ཉི་མ་འགའི་དགེ་བའི་རྩ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Subhūti,” continued the Blessed One, “when any noble son or noble daughter, abiding in accordance with the teachings as they are revealed in this profound perfection of wisdom, dedicates the roots of virtuous action of just a few days toward unsurpassed, complete enlightenment, the merit of that noble son or noble daughter would increase manifold more than those.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བསྔོ་བ་ཐམས་ཅད་ཀྱི་སྔོན་དུ་འགྲོ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: If you ask why, Subhūti, the perfection of wisdom precedes all dedications.

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པར་བྱའོ། །གསོལ་པ།
en: So it is, Subhūti, that bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should be skilled in the dedication of the perfection of wisdom.” “

source: བཅོམ་ལྡན་འདས་མངོན་པར་འདུ་བགྱི་བ་མ་མཆིས་པ་ནི་ཡོངས་སུ་བརྟགས་པའོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ན།
en: Blessed Lord, since the Blessed One has said that phenomena that are not subject to conditioning are imaginary, how {Ki.

source: དེ་ལ་ཇི་ལྟར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་བར་འགྱུར་བ་ལགས།
en: IV: 171} could the merit of those noble sons or noble daughters increase manifold, more than the former?

source: བཅོམ་ལྡན་འདས་མངོན་པར་འདུ་བགྱི་བ་མ་མཆིས་པས་ནི་ཡང་དག་པར་ལྟ་བ་བསྐྱེད་པའམ། སྐྱོན་མ་མཆིས་པར་ཡང་འཇུག་པར་མི་ནུས་སོ།
en: Blessed Lord, that which is not subject to conditioning cannot generate the authentic view or even enter into the maturity [of the bodhisattvas]!

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འཐོབ་པའམ་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུའམ་ཕྱིར་མི་འོང་བའི་འབྲས་བུའམ་དགྲ་བཅོམ་པ་ཉིད་འཐོབ་པའམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་ཡང་མི་ནུས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Nor can it attain the fruit of entering the stream to nirvāṇa, or attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or arhatship [and so forth], up to and including the attainment of consummate buddhahood in unsurpassed, complete enlightenment.” “

source: མངོན་པར་འདུ་བྱ་བ་མེད་པས་ནི་ཡང་དག་པར་ལྟ་བ་བསྐྱེད་པ་འམ།
en: That which is not subject to conditioning cannot generate the authentic view or even enter into the maturity [of the bodhisattvas]!

source: སྐྱོན་མེད་པར་འཇུག་པའམ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འཐོབ་པའམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ་དགྲ་བཅོམ་པ་ཉིད་འཐོབ་པ་འམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་མི་ནུས་ཏེ།
en: Nor can it attain the fruit of entering the stream to nirvāṇa, or attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or arhatship [and so forth], up to and including the attainment of consummate buddhahood in unsurpassed, complete enlightenment.

source: རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྦྱིན་པ་དེ་ཡང་མངོན་པར་འདུ་བྱ་བ་མེད་པ་སྟེ། སྟོང་པ་ཉིད་དུ་སྣང་ངོ་གསོབ་ཉིད་དུ་སྣང་ངོ་གསོག་ཉིད་དུ་སྣང་ངོ་། །སྙིང་པོ་མེད་པ་ཉིད་དུ་སྣང་ངོ་།
en: In this case, Subhūti, those gifts of bodhisattva great beings who practice the perfection of wisdom are not subject to conditioning—they are declared to be just empty, they are declared to be just hollow, they are declared to be just void, and they are declared to be essenceless.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བདེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ནང་སྟོང་པ་ཉིད་ལ་ཤིན་དུ་བསླབས་པའོ།
en: If you ask why, Subhūti, it is because bodhisattva great beings have thoroughly trained in the emptiness of internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་ཤིན་དུ་བསླབས་པའོ།
en: They have thoroughly trained in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྟོང་པ་ཉིད་དེ་དག་ལ་གནས་ཤིང་།
en: Subhūti, these bodhisattva great beings dwell in those aspects of emptiness.

source: ཇི་ལྟ་ཇི་ལྟར་མངོན་པར་འདུ་བྱ་བ་མེད་པ་དེ་དག་ལ་རབ་ཏུ་རྟོག་པ། དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བར་འགྱུར་ཏེ།
en: Insofar as they discern phenomena that are not subject to conditioning, bodhisattva great beings will not lack the perfection of wisdom.

source: ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བ་དེ་ལྟ་དེ་ལྟར་གྲངས་མེད་དཔག་ཏུ་མེད་ཚད་མེད་པའི་བསོད་ནམས་འཕེལ་བར་འགྱུར་རོ།
en: Insofar as bodhisattva great beings do not lack the perfection of wisdom, their incalculable, inestimable, and immeasurable merits will increase.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གྲངས་མ་མཆིས་པ་དང་དཔག་ཏུ་མ་མཆིས་པ་དང་། ཚད་མ་མཆིས་པ་ལ་བྱེ་བྲག་ནི་ཅི་མཆིས་ཁྱད་ནི་ཅི་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what are the distinctions and what are the differences between the incalculable, the inestimable, and the immeasurable?” “

source: རབ་འབྱོར་གྲངས་མེད་པ་ཞེས་བྱ་བ་ནི་གང་འདུས་བྱས་ཀྱི་ཁམས་སམ། འདུས་མ་བྱས་ཀྱི་ཁམས་སུ་བགྲང་བར་ཉེ་བར་མི་འགྲོ་བའོ།
en: Subhūti,” replied the Blessed One, “the term incalculable suggests that the number of conditioned elements and unconditioned elements cannot be approximated.

source: །རབ་འབྱོར་དཔག་ཏུ་མེད་པ་ཞེས་བྱ་བ་ནི་འདས་པ་དང་མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ལ་ཚད་མི་དམིགས་པའོ།
en: Subhūti, the term inestimable suggests that the extent of past, future, and present phenomena cannot be apprehended.
